from pandas import Series, DataFrame
from datetime import datetime

Index_Info = {
	# 政策性金融债指数
	'CBA00101.CS': 		['中债-新综合财富指数', '新综合指数', '2002/01/04', '债券', '中国大陆'],
	'CBA05801.CS': 		['中债-国债及政策性银行债财富指数', '国债及政金债指数', '2007/01/04', '债券', '中国大陆'],
	'CBA07401.CS': 		['中债-1-3年政策性金融债财富指数', '1-3年政金债指数', '2018/04/17', '债券', '中国大陆'],
	'CBA09301.CS': 		['中债-3-5年政策性金融债财富指数', '3-5年政金债指数', '2014/12/31', '债券', '中国大陆'],
	'CBA08201.CS': 		['中债-7-10年政策性金融债财富指数', '7-10年政金债指数', '2012/01/04', '债券', '中国大陆'],

	# 国开债指数
	'CBA02501.CS': 		['中债-国开行债券总财富指数', '国开债总指数', '2002/01/04', '债券', '中国大陆'],
	'CBA07701.CS': 		['中债-1-3年国开行债券财富指数', '1-3年国开债指数', '2012/01/04', '债券', '中国大陆'],
	'CBA06301.CS': 		['中债-3-5年国开行债券财富指数', '3-5年国开债指数', '2012/01/04', '债券', '中国大陆'],
	'CBA05201.CS': 		['中债-7-10年国开行债券财富指数', '7-10年国开债指数', '2012/01/04', '债券', '中国大陆'],

	# 高等级信用债指数
	'CBC00101.CS':      ['中债-中国高等级债券财富指数', '高等级债券指数', '2008/01/02', '债券', '中国大陆'],

	# 股票指数
	'000001.SH':		['上证综合指数', '上证综指', '2001/01/01', '股票', '中国大陆'],
	'399006.SZ':		['创业板指数', '创业板指', '2010/06/01', '股票', '中国大陆'],

	'H00016.SH':		['上证50全收益指数', '上证50全收益', '2004/01/02', '股票', '中国大陆'],
	'H00903.CSI': 		['中证100全收益指数', '中证100全收益', '2006/05/29', '股票', '中国大陆'],
	'H00905.CSI': 		['中证500全收益指数', '中证500全收益', '2007/01/15', '股票', '中国大陆'],

	'H00300.CSI':		['沪深300全收益指数', '沪深300全收益', '2006/04/10', '股票', '中国大陆'],
	'000300.SH': 		['沪深300价格指数', '沪深300', '2002/01/04', '股票', '中国大陆'],
	'510300.OF': 		['华泰柏瑞沪深300ETF', '沪深300ETF', '2012/06/01', '股票', '中国大陆'],

	'2822.HK': 			['南方A50指数', '南方A50', '2012/11/08', '股票', '香港'],
	'2822.OF': 			['南方A50基金', '南方A50基金', '2012/11/08', '股票', '香港'],

	'CES105.CSI':   	['中华沪深港300全收益指数', '沪深港300全收益', '2009/01/01', '股票', '中国大陆'],
	'CES300.CSI': 		['中华沪深港300价格指数', '沪深港300', '2009/01/01', '股票', '中国大陆'],
	'160925.OF': 		['大成中华沪深港300', '大成沪深港300', '2019/03/20', '股票', '中国大陆'],

	'H00922.CSI':   	['中证红利全收益指数', '中证红利全收益', '2008/05/23', '股票', '中国大陆'],
	'000922.CSI': 		['中证红利价格指数', '中证红利', '2005/01/04', '股票', '中国大陆'],
	'090010.OF': 		['大成中证红利指数基金', '大成中证红利', '2010/02/02', '股票', '中国大陆'],

	# 货币市场基金
	'H11025.CSI': 		['中证货币型基金指数', '货基指数', '2004/01/07', '货币基金', '中国大陆'],
	'000129.OF':		['大成景安短融B', '景安短融', '2013/07/01', '短融基金', '中国大陆'],

	# 商品指数
	'IMCI.SHF': 		['上期有色金属指数', '有色金属指数', '2012/01/04', '商品指数', '中国大陆']


}

Index_Info = DataFrame(Index_Info).T
Index_Info.columns = ['FullName', 'Name', 'StartDate', 'AssetType', 'MarketPlace']
Index_Info.insert(0, 'WindCode', Index_Info.index.tolist())
Index_Info = Index_Info.reset_index(drop=True)

Index_Info['StartDate'] = Index_Info['StartDate'].apply(lambda x: datetime.strptime(x, '%Y/%m/%d').strftime('%Y%m%d'))
Index_Info.loc[:, 'ProductType'] = Index_Info['WindCode'].apply(lambda x: '基金' if x[-3:] == '.OF' else '指数')




